// Створити разом з учнями скрипт, який буде отримувати від користувача число (кількість хвилин) і буде виводити рядок в форматі часу як результат. Наприклад 80 виведе 01:20 450 - 07:30. Можете використати наступні формули
//   const numberHours = 1000 / 60;
//   const days = Math.floor(numberHours / 24);
//   const hours = Math.floor(numberHours % 60);
//   const modHours = String(hours).padStart(2, 0);
//   const minutes = 1000 % 60;
//   const modMinutes = String(minutes).padStart(2, 0);

//   console.log(numberHours);
//   console.log(days);
//   console.log(hours);
//   console.log(modHours);
//   console.log(minutes);
//   console.log(modMinutes);
  

//   Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .length, вивести в консоль кількість символів у рядку.

// const name = "rostislav"
// const lastName = "belskyi" 

// let fullName = `${name} ${lastName}`;

// console.log(fullName.length);

// Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .toUpperCase(), перетворити рядок у верхній регістр та вивести результат в консоль.

// const name = "rostislav";

// const result = name.toUpperCase();

// console.log(result);

// Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .charAt(), вивести перший символ вашого імені в консоль.

// const name = "rostislav";

// const result = name.charAt(0);

// console.log(result);


// Створити змінну, яка містить рядок з вашим ім'ям та прізвищем. Використовуючи метод .indexOf(), знайти і вивести в консоль позицію, на якій знаходиться пробіл між ім'ям та прізвищем.

// const name = "rostislav";

// const lastName = "belskyi"

// let fullName = `${name} ${lastName}`

// const result = fullName.indexOf(" ")

// console.log(result);\




// Створити змінну, яка містить рядок з вашим ім'ям. Використовуючи метод .replace(), замінити першу літеру вашого імені на символ "@" та вивести результат в консоль.

// const name = "rostislav";

// let place = name.replace(name[0],"@")

// console.log(place);


// Створити змінну, яка містить рядок зі словом "JavaScript". Використовуючи метод .substring(), вивести підстроку, яка містить перші 4 символи слова "Java".


// const name = "JavaScript";

// let place = name.substring(0,4);

// console.log(place);


// Напиши скрипт який виведе рядок в форматі: “Гість x y поселяється в n номер g”, підставивши замість x, y, n, g значення змінних.


// let x = "oleg"

// let y = "bob"

// let n = 201

// let g = 222


// const hotel = `гость ${x} ${y} поселяется в ${n} номер ${g} `

// console.log(hotel);




// Використовуючи if..else, напишіть код, що отримує число з інпуту і потім виводить повідомлення на екран:
// 1, якщо значення більше нуля,
// -1, якщо меньше нуля,
// 0, якщо дорівнює нулю.


// const input = Number (prompt("введите число"))
// console.log(typeof input);

// if(input>0){
//     console.log(1);    
// }else if(input<0){
//     console.log(-1);   
// }
// else {
//     console.log(0);
// }


// Напиши скрипт обробки покупки в магазині. 
//   - Баланс користувача зберігається в змінній balance - отримати з інпуту
//   - Сумма покупки зберігається в змінній payment - отримати з інпуту
//   - Перед перевіркою вивести повідомлення на екран:
//   «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
//   доступних коштів на рахунку»
//  - Якщо сума покупки не перевищує баланс:
//      - Відняти з балансу суму покупки
//    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
//  - Якщо сума покупки перевищує баланс:
//     - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
//  - В кінці вивести повідомлення «Операція завершена»

// let balans = prompt("ваш баланс")

// const payment = prompt("сумма покупки")

// alert(`общая стоимость покупки ${payment}`) 

// if(balans>payment){
//     balans-=payment
//     alert(`на балансе осталось ${balans}`)   
// }

// else if(balans<payment){
//     alert(`на балансе недостаточно средств`)
// }


//  Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
//  - Загальна сума витрачених коштів зберігається в змінній totalSpent
//  - Сума поточного платежа зберігається в змінній payment
//  - Знижка зберігається в змінній discount

//  - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//  - Якщо витрачено менше 100) - не партнер, знижка 0%

//  - В результаті вивести повідомлення
//  «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

// Створіть дві змінні для зберігання значень двох текстових полів. Перевірте, чи обидві змінні не є порожніми. Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".


// const name = "aleg"

// const surname = "oleg"

// if(name!=="" && surname!==""){
//     console.log("Обидва поля заповнені")  
// }

// else 


// Написати програму яка перевіряє чи введене число через input потрапляє в діапазон від 55 до 99 включно. Якщо так, вивести на екран "Число потрапляє в діапазон". Якщо ні, вивести "Число не потрапляє в діапазон".


// const input = Number(prompt("Введите число"))

// if(input >= 55 && input <= 99 ){
//     alert("число попадает в диапазон")
// }
// else  {
//     alert("не попадает в диапазон")
// }


// Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100). До якої групи відноситься Максим, якщо йому 55 років. Назву групи вивести на екран.
// > больше
// const max = 55

// if(max >= 0 && max <= 16 ){
//     console.log("kid"); 
// }

// else if (max >= 17 && max <= 60){
//     console.log("взрослый");   
// }

// else {
//     console.log("пенсионер");  
// }



// Якщо ваше ім’я містить більше 4 букв і прізвище більше 5, то виведіть на екран число,яке дорівнює сумі букв імені і прізвища. Якщо умова не виконується - вивести “УПС”. Наприклад: “Віктор Сташко” Віктор - 6 літер, Сташко - 6 літер. Виводимо 12. Використовувати вбудований метод length.


// const name = prompt("введите ваше имя")

// const lastname = prompt("введите фамилию")


// if(name.length >= 4 && lastname.length >= 5){
//     console.log(`общая число символов ${name.length + lastname.length}`);
// }

// else {console.log(alert("упс"));
// }


// Виберіть будь-яке число від 1 до 5 включно через функцію random. За допомогою if else визначіть, що це за число.

// const number = Math.floor( Math.random()* (5-1)+1)

// if(number === 1){
// console.log("1");
// }else if(number === 2){
//     console.log("2");   
// }else if(number === 3){
//     console.log("3");   
// }else if(number === 4){
//     console.log("4");   
// }else if(number === 5){
//     console.log("5");   
// }

// Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
//  - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//  - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
//             - 'Посилка буде відправлена сьогодні'
//             - 'Вам передзвонит менеджер'.
// Напиши скрипт вибору готеля по кількості зірок.
// 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
//  Якщо в змінній stars щось окрім чисел 1-5, виведи рядок
//  'Токої кількості зірок немає'


// switch(userName){
//     case "jura":
//         res = "Ваше имя Юра"
//         break;
//     case "rostislav":
//          res = "Ваше имя Ростислав"
//          break;
//     case "natascha":
//          res = "Ваше имя Наташа"  
//          break;  
//     default:
//         res = "Немає збігу імен"       

// }

// let option = Number(prompt("выберите тип доставки"))

// let message = ""

// if(option === 1){
//     message = "самовывоз"
// }
// else if(option === 2){
//     massage = "курьер" 
// }
// else if(option === 3){
//     massage = "курьер" 
// }
// else{alert = "введите от 1 до 3"};

// let num = "";

// for(let i = 0; i <= 5 ; i+=1) {    
// console.log(i);
// }

// let num = "";

// for(let i = 0; i <= 5 ; i+=1) {    
//     if(i % 2 !==0){
//         console.log(i);  
//     }
// }


// Напиши скрипт який підраховує загальну суму зп працівників. Кількість робітників зберігається в змінній employees. ЗП кожного працівника це випадкове число від 500 до 5000.  Записати суму в змінну totalSalary і вивести в на сторінку.

// const random = Math.floor(Math.random()*(5000-500));


// for(let i = 0; i <= 3; i+=1){
//     const random = Math.floor(Math.random()*(5000-500));
//     console.log(random);
    
// }

// let field1 = "привет";
// let field2 = "свет";

// if (field1 !== "" && field2 !== "") {
//     console.log("есть");
// } else {
//     console.log("Нет");
// }

// let num1 = 7;
// let num2 = 5;
// let sum = num1 + num2;

// if (sum > 10) {
//     console.log("Сума более 10");
// } else {
//     console.log("Сума менее 10");
// }


// let message = "Я учу JavaScript";

// if (message.includes("JavaScript")) {
//     console.log("JavaScript");
// } else {
//     console.log("не JavaScript");
// }


// let myNumber = 15;

// if (myNumber > 10 && myNumber < 20) {
//     console.log("Число входит в диапазон 10 до 20");
// } else {
//     console.log("Число не входит в диапазон від 10 до 20");
// }


// let userName = "Олексей";
// let userEmail = "test@example.com";
// let userPassword = "password123";


// if (
//     userName.length >= 3 && 
//     userEmail.includes("@") && 
//     userPassword.length >= 6
// ) {
//     console.log("Перенаправленние");
// } else {
//     console.log("неправильное заполнение");
// }

// TASK 5 ================================================================================

// let choose = prompt("какой ваш выбор сок яблоко или ёж");

// let res;

// switch(choose){
//     case "juice":
//         res = "ваш сок"
//         break;
//     case "apple":
//          res = "ваш выбор яблоко"
//          break;
//     case "ik":
//          res = "ваш выбор ёж"  
//          break;  
//     default:
//         res = "у вас нет выбора"   

//         console.log(choose);
        
// }

// let day = prompt("введить день недели")

// switch (day) {
//   case "субота":
//   case "неділя":
//     console.log("Це вихідний день!");
//     break;
//   case "понеділок":
//   case "вівторок":
//   case "середа":
//   case "четвер":
//   case "п'ятниця":
//     console.log("Це робочий день.");
//     break;
//   default:
//     console.log("Некоректне введення.");
// }


// let color = prompt("Введіть колір (красный желтый зеленый)");

// switch (color) {
//     case "красный":
//         console.log("стоп");
//         break;
//     case "желтый":
//         console.log("ждать");
//         break;
//     case "зеленый":
//         console.log("идти");
//         break;
//     default:
//         console.log("неизвестно");
// }


// const num1 = Number(prompt("введите первое число"))


// const num2 = Number(prompt("введите второе число"))

// const oper = prompt("введите оператор -,+, *, /,")

// let result = 0

// if(oper === "+"){
//     result = num1 + num2;
// }
// else if (oper === "-"){
//     result = num1 - num2;
// }
// else if (oper === "*"){
//     result = num1 * num2;
// }
// else if (oper === "/"){
//     result = num1 / num2;
// }

// console.log(result);


// const num1 = Number(15);

// const num2 = Number(5);

// const oper = prompt("выберите оператор");

// let res = 0

// if(oper === "+"){
//     res = num1 + num2;
// }
// else if (oper === "-"){
//     res = num1 - num2;
// }
// else if (oper === "*"){
//     res = num1 * num2;
// }
// else if (oper === "/"){
//     res = num1 / num2;
// }

// console.log(res);



// task 6 ===============================================================












  
  
  
  